# SQLite vignette

December 27, 2022

Vignette: SQLite

@author: Oscar Trevizo

## References
* Harvard Data Science Foundations CSCI E101 by Prof. Huang.
* MySQL Documentation (Accessed Mar. 9, 2022) https://dev.mysql.com/doc/
* Pandas PyData: https://pandas.pydata.org/
* NumPy: https://numpy.org/
* SciPy: https://scipy.org/
* Python docs: https://docs.python.org/3/tutorial/index.html
* Pndas docs: https://pandas.pydata.org/docs/index.html
* w3school web site (Accessed March 30, 2022) https://www.w3schools.com/sql/sql_syntax.asp
* geekforgeeks web site (Accessed March 30, 2022) https://www.geeksforgeeks.org/sql-ddl-dql-dml-dcl-tcl-commands/

## SQL: Structured Query Language
* Originally developed by IBM, SEQUEL
* Standard database programming language for interfacing with relational databases to create, maintain, and retrieve databases / schemas, tables, and records

### Top SQL commands
* CREATE DATABASE - creates a new database
* CREATE SCHEMA - same as CREATE DATABASE
* CREATE TABLE - creates a new table
* INSERT INTO - inserts new data into a database
* USE - selects a database to use
* SHOW DATABASES - pulls database names available
* LOAD DATA INFILE 'filename' INTO TABLE ... - reads data from a file
* UPDATE - updates data in a database
* SET - various uses, e.g. change datatype to date
* UNION - combine results from two SELECT statements
* RAND(seed) - return random number, optional seed
* SELECT - extracts data from a database
* SELECT ... INTO OUTFILE 'file_name' - Write data to file (e.g. csv)
* SELECT ... FROM 'database.table' WHERE condition -- Select fields that meet condition
* SELECT col1, col2, MAX(col3) FROM 'database.table' WHERE condition GROUP BY col1, col2 -- Needs GROUP BY
* DROP DATABASE - deletes a database
* DROP TABLE - deletes a table
* DROP INDEX - deletes an index
* DELETE - deletes data from a database
* ALTER DATABASE - modifies a database
* ALTER TABLE - modifies a table
* CREATE INDEX - creates an index (search key)

### SELECT examples
-- selects random records and writes to filename

SELECT list of columns UNION (SELECT * FROM db.tbl ORDER BY RAND(seed) LIMIT number) INTO OUTFILE 'filename' FIELDS TERMINATED BY ',' OPTIONALLY ENCLOSED BY '"' LINES TERMINATED BY '\n';

--  calculates average of column_name

SELECT AVG(column_name) FROM db.tbl;

-- calculate the number of column col1 that has column col2 is larger than a quantity

SELECT COUNT(col1) FROM db.tbl WHERE col2 > a_number;

-- Get the last name of the ones who make > 150K and < 5 yrs tot experience

SELECT last_name FROM teacher_sample.teachers WHERE salary > 150000 AND experience_total < 5;

-- Get highest salary for 'Preschool'

SELECT MAX(salary) FROM teacher_sample.teachers WHERE primary_job = 'Preschool';

-- Get highest salary for 'School Counselor'

SELECT MAX(salary) FROM teacher_sample.teachers WHERE primary_job = 'School Counselor';

-- Get highest salary for job that has the word 'Principal'

SELECT MAX(salary) FROM teacher_sample.teachers WHERE primary_job LIKE '%Principal%';

-- Get highest salary for 'School Psychologist'

SELECT MAX(salary) FROM teacher_sample.teachers WHERE primary_job = 'School Psychologist';

-- Get highest salary for 'Kindergarten'

SELECT MAX(salary) FROM teacher_sample.teachers WHERE primary_job = 'Kindergarten';

-- Get the last_name, first_name, and salary of the lowest earnest in Atlantic City

-- Tip on ASC LIMIT from https://stackoverflow.com/questions/13357144/how-to-select-data-where-a-field-has-a-min-value-in-mysql

SELECT last_name, first_name, salary FROM teacher_sample.teachers WHERE district = 'Atlantic City' ORDER BY salary ASC LIMIT 1;

-- Get tot no of empl in Passaic City with > 10 yrs tot_expe

SELECT COUNT(last_name) FROM teacher_sample.teachers WHERE district = 'Passaic City' AND experience_total > 10;

-- Go to https://dev.mysql.com/doc/refman/8.0/en/group-by-handling.html

-- Use GROUP BY followed by the columns to avoid randomness

SELECT last_name, first_name, primary_job, MAX(salary) FROM nj_state_teachers_salaries.nj_state_teachers_salaries WHERE primary_job = 'Preschool' GROUP BY last_name, first_name, primary_job;

The following list comes from geekforgeeks.org web site.

### SQL commands categories
* DDL – Data Definition Language
* DQl – Data Query Language
* DML – Data Manipulation Language
* DCL – Data Control Language

#### DDL (Data Definition Language): 
* CREATE: This command is used to create the database or its objects (like table, index, function, views, store procedure, and triggers).
* DROP: This command is used to delete objects from the database.
* ALTER: This is used to alter the structure of the database.
* TRUNCATE: This is used to remove all records from a table, including all spaces allocated for the records are removed.
* COMMENT: This is used to add comments to the data dictionary.
* RENAME: This is used to rename an object existing in the database.

#### DQL (Data Query Language):
* SELECT: It is used to retrieve data from the database.

#### DML(Data Manipulation Language): 
* INSERT : It is used to insert data into a table.
* UPDATE: It is used to update existing data within a table.
* DELETE : It is used to delete records from a database table.
* LOCK: Table control concurrency.
* CALL: Call a PL/SQL or JAVA subprogram.
* EXPLAIN PLAN: It describes the access path to data.

#### DCL (Data Control Language): 
* GRANT: This command gives users access privileges to the database.
* REVOKE: This command withdraws the user’s access privileges given by using the GRANT command.

####  TCL (Transaction Control Language):
* COMMIT: Commits a Transaction.
* ROLLBACK: Rollbacks a transaction in case of any error occurs.
* SAVEPOINT:Sets a savepoint within a transaction.
* SET TRANSACTION: Specify characteristics for the transaction.

# Import libraries

In [1]:
import sqlite3
import pandas as pd

# Connect SQLite

In [2]:
# First assign a filename for your database
dbFile = "../data/mysqlite_db.db"
mydb = sqlite3.connect(dbFile)

# My cursor method

## Instantiate mycursor

In [3]:
mycursor = mydb.cursor()

# Build a command: strings

In [4]:
# cmd here is here to capture a command in the form of a string...
# ... as if you were typing it in SQL.

cmd = 'DROP TABLE IF EXISTS people;'

## Execute the command

You can also type the command within the *execute()* method.

In [5]:
mycursor.execute(cmd)

# Prepare the database

In [6]:
cmd = """ CREATE TABLE IF NOT EXISTS people (
                        name TEXT NOT NULL PRIMARY KEY,
                        city TEXT,
                        zip TEXT
                     ) ; """
mycursor.execute(cmd)

# Insert data
Here you simply type the SQL command within quotation marks in the

In [7]:
cmd = "INSERT INTO people (name, city, zip) VALUES (?, ?, ?)"
value = ('Elaine', 'New York', '10124')

In [8]:
mycursor.execute(cmd, value)

In [9]:
mycursor.execute('COMMIT;')
# mydb.commit()

# Execute many

In [10]:
## Build the command

In [11]:
# The command string
cmd = "INSERT INTO people (name, city, zip) VALUES (?, ?, ?)"

# A list of tuples with many values separated by commas.
values = [
  ('Jane', 'Boston', '02116'),
  ('Rob', 'Chicago', '60610'),
  ('Mary', 'LA', '90090')]

## Execute it

In [12]:
mycursor.executemany(cmd, values)
# mydb.commit()

# Pandas method

In [13]:
# Now we can simply assign the SQL command to a string, similarly as above
cmd = " SELECT * FROM people ORDER BY zip; "

In [14]:
df = pd.read_sql_query(cmd, mydb)
df.head()

     name      city    zip
0    Jane    Boston  02116
1  Elaine  New York  10124
2     Rob   Chicago  60610
3    Mary        LA  90090